#include "comm.h"

uchar cnt;  //
//*************************************************************************
//			外部中断0初始化子程序
//          光电开关有物体接近 低电平 物体离开 高电平。 
//          初始位置打桩机在最上面 光电开关低电平，启动 上升沿触发
//*************************************************************************
void ext_int0_init()
{
  EIMSK|=0x02;                                     //使能外部中断1
  EICRA=0x0A;                                     //下降沿触发方式    
  MCUCSR=0x00;                                    //控制和状态寄存器初始化
}

//*************************************************************************
//	   中断服务子程序
//*************************************************************************




ISR(INT1_vect,ISR_NOBLOCK)                   //中断1服务程序
{
  SREG &=~0x80;  //关全局中断

  SET_EVT(EV_INT1_KEY); 
  setkey_cnt++;
  if(setkey_cnt >2)
  {
        setkey_cnt=0;
  }

  SREG &=~0x80;  //关全局中断
}
