#include "comm.h"

//*************************************************************************
//			串口1初始化子程序 开 接收 发送 数据空 中断
//*************************************************************************
void usart1_init()
{
  UCSR1B = 0x00;                               //禁止发送和接收
  UCSR1A=0x00;                                 //单倍速模式                         
  UCSR1C=(1<<UCSZ11)|(1<<UCSZ10);              //写UCSRC寄存器,异步通信无校验，8位数据1位停止位 0x06
  UBRR1H=baud_h;                               //写波特率的值
  UBRR1L=baud_l; 
  uart1_rcv_buf_init();                        //usart1串口接收缓冲区初始化
}



//*************************************************************************
//		USART1接收中断服务子程序
//*************************************************************************

                                   //数据接收结束中断向量
SIGNAL(SIG_USART1_RECV)            //中断服务程序
{
    usart1_rx_data=UDR1;            //将接收到的数据取出 次操作必须要在中断服务子程序中做。
    usart1_recv_handler();

}
                                  //数据寄存器空中断向量

//***********************************************************************
//      USART1发送函数
//***********************************************************************
//****************发送一个字符******************************
void usart1_char_send(uchar i)
{
	while(!(UCSR1A&(1<<UDRE1)));
	UDR1=i;
}
/******************发送一个字符串*************************/
void usart1_str_send(char *s)
{
	 while(*s)
	 {
		 usart1_char_send(*s);
		 s++;
	 }
}
/******************发送一个缓冲区*************************/
void usart1_buf_send(uchar *pBuf,uchar ucBufLen)
{
	 uchar ucCnt = ucBufLen;
	 if (ucCnt == 0)
	 {
		 return;
	 }
	 while(ucCnt--)
	 {
		 usart1_char_send(*pBuf);
		 pBuf++;
	 }
}


//*************************************************************************
//			串口0初始化子程序 开 接收 发送 数据空 中断
//*************************************************************************
void usart0_init()
{
  UCSR0B = 0x98; 
//  UCSR0B = 0x00;                               //禁止发送和接收
  UCSR0A=0x00;                                 //单倍速模式                         
  UCSR0C=(1<<UCSZ11)|(1<<UCSZ10);              //写UCSRC寄存器,异步通信无校验，8位数据1位停止位 0x06
  UBRR0H=baud_h;                               //写波特率的值
  UBRR0L=baud_l; 
  uart0_rcv_buf_init();                        //usart0串口接收缓冲区初始化
}



//*************************************************************************
//		USART0接收中断服务子程序
//*************************************************************************

                                   //数据接收结束中断向量
SIGNAL(SIG_USART0_RECV)            //中断服务程序
{
    usart0_rx_data=UDR0;            //将接收到的数据取出 次操作必须要在中断服务子程序中做。
    usart0_recv_handler();

}
                                  //数据寄存器空中断向量

//***********************************************************************
//      USART0发送函数
//***********************************************************************
//****************发送一个字符******************************
void usart0_char_send(uchar i)
{
	while(!(UCSR0A&(1<<UDRE0)));
	UDR0=i;
}
//******************发送一个字符串*************************
void usart0_str_send(char *s)
{
	 while(*s)
	 {
		 usart0_char_send(*s);
		 s++;
	 }
}
//******************发送一个缓冲区*************************
void usart0_buf_send(uchar *pBuf,uchar ucBufLen)
{
	 uchar ucCnt = ucBufLen;
	 if (ucCnt == 0)
	 {
		 return;
	 }
	 while(ucCnt--)
	 {
		 usart0_char_send(*pBuf);
		 pBuf++;
	 }
}

